{
  "achievementsData": [
    {
      "title": "KEC Quiz Team Win the Championship of BIZQUIZ 24'",
      "date": "25 OCT 2024",
      "description": "KEC Quiz team won the 1st place at BizQuiz 24' defeating all the schools in Kandy district. The competition was organized by the Society of Industrial Relations & Entrepreneurship Development in University of Peradeniya. Moreover, this is the first competition for our 24/25 quiz team. They won the trophy by their first competition giving a great start and first impression.",
      "thumbnail": "bizquiz24.png"
    },
    {
      "title": "Official Instagram Page Launched",
      "date": "04 NOV 2024",
      "description": "The Kingswood Entrepreneurs’ Club launched its official Instagram page on 25th November 2024. This platform aims to boost our club’s visibility, share our journey, and showcase our activities with the wider community. Through curated content, we hope to inspire and connect with budding entrepreneurs. The page also serves as a promotional space for our sponsors, providing them with enhanced visibility and aligning their brands with our mission to foster entrepreneurial spirit.",
      "thumbnail": "insta launch-min.png"
    },
    {
      "title": "Official Website Launched",
      "date": "25 NOV 2024",
      "description": "On November 25, 2024, we proudly launched the official website of the Kingswood Entrepreneurs' Club, marking a significant milestone in connecting with our community and beyond. The website serves as an accessible platform to display club events, achievements, and initiatives, providing an engaging space for our members and the public. Additionally, it offers visibility to our sponsors, highlighting their support and partnership. Through our website, we aim to inspire entrepreneurial aspirations, celebrate achievements, and strengthen connections within our community. Visit us to stay informed about our journey and contributions!",
      "thumbnail": "web launch_4-min.png"
    }
  ]
}
